MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
/**
 *******************************************************************************
 * @file hc32_ll_dsogi_pll.c
 * @brief This file provides firmware functions to manage the DSOGI_PLL.
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2025, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_dsogi_pll.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_DSOGI_PLL DSOGI_PLL
 * @brief DSOGI_PLL Driver Library
 * @{
 */

#if (LL_DSOGI_PLL_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup DSOGI_PLL_Local_Macros DSOGI_PLL Local Macros
 * @{
 */

#define DSOGI_PLL_FLOAT_CONV(x) (*(__IO float32_t *)((uint32_t)&x))

#define FLOAT_WRITE_REG32(reg, value) WRITE_REG32((reg), (*(__IO uint32_t *)((uint32_t)&(value))));

/**
 * @defgroup DSOGI_PLL_Check_Parameters_Validity DSOGI_PLL Check Parameters Validity
 * @{
 */
#define IS_DSOGI_PLL_PERIPH(x) ((x) == CM_DSOGI_PLL)

#define IS_DSOGI_PLL_FUNC(x)                                                                                        \
    (((x) == DSOGI_PLL_THREE_PHASE_DSOGI) || ((x) == DSOGI_PLL_THREE_PHASE_SYNC) || ((x) == DSOGI_PLL_SINGLE_PHASE) \
  || ((x) == DSOGI_PLL_CLARK) || ((x) == DSOGI_PLL_SOGI) || ((x) == DSOGI_PLL_PARK) || ((x) == DSOGI_PLL_PLL))

#define IS_DSOGI_PLL_COMB_FUNC(x)                                                          \
    (((x) == DSOGI_PLL_COMB_THREE_PHASE_DSOGI) || ((x) == DSOGI_PLL_COMB_THREE_PHASE_SYNC) \
  || ((x) == DSOGI_PLL_COMB_SINGLE_PHASE))

#define IS_DSOGI_PLL_CLARK_SRC(x) \
    (((x) == DSOGI_PLL_CLARK_ABC) || ((x) == DSOGI_PLL_CLARK_ADC1_234) || ((x) == DSOGI_PLL_CLARK_ADC123_2))

#define IS_DSOGI_PLL_CLARK_VOLT(x)                                                        \
    (((x) == DSOGI_PLL_CLARK_PHASE_VOLT_AB) || ((x) == DSOGI_PLL_CLARK_PHASE_VOLT_BC)     \
  || ((x) == DSOGI_PLL_CLARK_PHASE_VOLT_AC) || ((x) == DSOGI_PLL_CLARK_PHASE_VOLT_ABC)    \
  || ((x) == DSOGI_PLL_CLARK_LINE_VOLT_AC_BC) || ((x) == DSOGI_PLL_CLARK_LINE_VOLT_AB_AC) \
  || ((x) == DSOGI_PLL_CLARK_LINE_VOLT_AB_BC))

#define IS_DSOGI_PLL_CLARK_ADC_GAIN(x)                                                              \
    (((x) == DSOGI_PLL_ADC_DIV1) || ((x) == DSOGI_PLL_ADC_DIV256) || ((x) == DSOGI_PLL_ADC_DIV1024) \
  || ((x) == DSOGI_PLL_ADC_DIV2048))

#define IS_DSOGI_PLL_SOGI_CALC(x) (((x) == DSOGI_PLL_SOGI_CAUL_1) || ((x) == DSOGI_PLL_SOGI_CAUL_2))

#define IS_DSOGI_PLL_SOGI_SIN_COS(x) (((x) == DSOGI_PLL_SOGI_SIN_COS_DISABLE) || ((x) == DSOGI_PLL_SOGI_SIN_COS_ENABLE))

#define IS_DSOGI_PLL_FLL_STATE(x) (((x) == DSOGI_PLL_FLL_DISABLE) || ((x) == DSOGI_PLL_FLL_ENABLE))

#define IS_DSOGI_PLL_PARK_THETA(x) (((x) == DSOGI_PLL_PARK_THETA_Q) || ((x) == DSOGI_PLL_PARK_THETA_D))

#define IS_DSOGI_PLL_PLL_PI_STATE(x) (((x) == DSOGI_PLL_PI_DISABLE) || ((x) == DSOGI_PLL_PI_ENABLE))

#define IS_DSOGI_PLL_PLL_STATE(x) (((x) == DSOGI_PLL_PLL_DISABLE) || ((x) == DSOGI_PLL_PLL_ENABLE))

#define IS_DSOGI_PLL_VOLT_JUDGE_STATE(x) (((x) == DSOGI_PLL_JUDGE_DISABLE) || ((x) == DSOGI_PLL_JUDGE_ENABLE))

#define IS_DSOGI_PLL_DELAYTIME(x) ((x) <= DSOGI_PLL_DELAYTIME_MAX)

#define IS_DSOGI_PLL_INT(x) (((x) != 0UL) && ((x) | DSOGI_PLL_INT_MASK) == DSOGI_PLL_INT_MASK)

#define IS_DSOGI_PLL_FLAG(x) (((x) != 0UL) && ((x) | DSOGI_PLL_FLAG_MASK) == DSOGI_PLL_FLAG_MASK)

#define IS_DSOGI_PLL_CLR_FLAG(x) (((x) != 0UL) && ((x) | DSOGI_PLL_CLR_FLAG_MASK) == DSOGI_PLL_CLR_FLAG_MASK)

#define IS_DSOGI_PLL_PWC_UNLOCKED() ((CM_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1)

/* DSOGI_PLL reset timeout */
#define DSOGI_PLL_RMU_TIMEOUT (100UL)

#define DSOGI_PLL_SAMPLE_TIME_DEFAULT (1.0f / 10000.0f)

#define DSOGI_PLL_BASE_FREQUENCY_DEFAULT (50.00f)

#define DSOGI_PLL_PI (3.14159265359f)

#define DSOGI_PLL_CENTER_ANGLE_FREQ (2.0f * DSOGI_PLL_PI * DSOGI_PLL_BASE_FREQUENCY_DEFAULT)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup DSOGI_PLL_Global_Functions DSOGI_PLL Global Functions
 * @{
 */

/**
 * @brief De-Initialize DSOGI_PLL unit base function.
 * @param [in] DSOGI_PLLx               Pointer to DSOGI_PLL unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_TIMEOUT:          Works timeout.
 */
int32_t DSOGI_PLL_DeInit(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx)
{
    int32_t i32Ret           = LL_OK;
    __IO uint32_t u32TimeOut = 0U;

    /* Check parameters */
    DDL_ASSERT(IS_DSOGI_PLL_PWC_UNLOCKED());
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    CLR_REG32_BIT(CM_RMU->FRST0, RMU_FRST0_DSOGI_PLL);
    /* Ensure reset procedure is completed */

