MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
    while (RMU_FRST0_DSOGI_PLL != READ_REG32_BIT(CM_RMU->FRST0, RMU_FRST0_DSOGI_PLL))
    {
        u32TimeOut++;

        if (u32TimeOut > DSOGI_PLL_RMU_TIMEOUT)
        {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
    }

    return i32Ret;
}

/**
 * @brief SOGI unit software reset.
 * @param [in] DSOGI_PLLx               Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] enNewState              The new state of SOGI software reset.
 *        This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void DSOGI_PLL_SWReset(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_SRST);
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_SRST);
    }
}

/**
 * @brief Set the fields of structure stc_sogi_pll_init_t to default values..
 * @param [in] pstcBaseInit            Pointer to a @ref stc_base_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcBaseInit is NULL
 */
int32_t DSOGI_PLL_Base_StructInit(stc_base_init_t *pstcBaseInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcBaseInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcBaseInit->f32Ts       = DSOGI_PLL_SAMPLE_TIME_DEFAULT;
        pstcBaseInit->f32BaseFreq = DSOGI_PLL_BASE_FREQUENCY_DEFAULT;
    }

    return i32Ret;
}

/**
 * @brief Initialize SOGI_PLL system calculation parameters.
 * @param [in] DSOGI_PLLx              Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcBaseInit            Pointer to a @ref stc_base_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcBaseInit is NULL
 */
int32_t DSOGI_PLL_Base_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_base_init_t *pstcBaseInit)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcBaseInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->TS, pstcBaseInit->f32Ts);
        FLOAT_WRITE_REG32(DSOGI_PLLx->FREBASE, pstcBaseInit->f32BaseFreq);
    }

    return i32Ret;
}

/**
 * @brief Initialize SOGI PLL Phase-Locked base function.
 * @param [in] DSOGI_PLLx              Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcSogiPllInit         Pointer to a @ref stc_sogi_pll_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcSogiPllInit is NULL
 */
int32_t DSOGI_PLL_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_sogi_pll_init_t *pstcSogiPllInit)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32CR;

    if (NULL == pstcSogiPllInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
        DDL_ASSERT(IS_DSOGI_PLL_COMB_FUNC(pstcSogiPllInit->u32Func));
        DDL_ASSERT(IS_DSOGI_PLL_CLARK_SRC(pstcSogiPllInit->stcClarkInit.u32SrcSelect));
        DDL_ASSERT(IS_DSOGI_PLL_CLARK_ADC_GAIN(pstcSogiPllInit->stcClarkInit.u32AdcGain));
        DDL_ASSERT(IS_DSOGI_PLL_PARK_THETA(pstcSogiPllInit->stcParkInit.u32ThetaSelect));
        DDL_ASSERT(IS_DSOGI_PLL_PLL_PI_STATE(pstcSogiPllInit->stcPllInit.u32PIState));
        DDL_ASSERT(IS_DSOGI_PLL_PLL_STATE(pstcSogiPllInit->stcPllInit.u32PLLState));
        DDL_ASSERT(IS_DSOGI_PLL_VOLT_JUDGE_STATE(pstcSogiPllInit->stcPllInit.u32JudgeState));
        DDL_ASSERT(IS_DSOGI_PLL_DELAYTIME(pstcSogiPllInit->stcPllInit.u32DelayTime));

        u32CR =
            (pstcSogiPllInit->stcClarkInit.u32SrcSelect | pstcSogiPllInit->stcParkInit.u32ThetaSelect
             | pstcSogiPllInit->stcPllInit.u32PIState | pstcSogiPllInit->stcPllInit.u32PLLState
             | pstcSogiPllInit->stcPllInit.u32JudgeState | pstcSogiPllInit->stcClarkInit.u32AdcGain
             | pstcSogiPllInit->u32Func | (pstcSogiPllInit->stcPllInit.u32DelayTime << DSOGI_PLL_CR_DELAY_TIME_POS));

        if (    (DSOGI_PLL_COMB_THREE_PHASE_DSOGI == pstcSogiPllInit->u32Func)
             || (DSOGI_PLL_COMB_SINGLE_PHASE == pstcSogiPllInit->u32Func))
        {
            DDL_ASSERT(IS_DSOGI_PLL_SOGI_SIN_COS(pstcSogiPllInit->stcSogiInit.u32SogiSCSelect));
            DDL_ASSERT(IS_DSOGI_PLL_FLL_STATE(pstcSogiPllInit->stcSogiInit.u32FLLState));

            u32CR |= (pstcSogiPllInit->stcSogiInit.u32SogiSCSelect | pstcSogiPllInit->stcSogiInit.u32FLLState);
        }

        if (    (DSOGI_PLL_COMB_THREE_PHASE_DSOGI == pstcSogiPllInit->u32Func)
             || (DSOGI_PLL_COMB_THREE_PHASE_SYNC == pstcSogiPllInit->u32Func))
        {
            DDL_ASSERT(IS_DSOGI_PLL_CLARK_VOLT(pstcSogiPllInit->stcClarkInit.u32VoltageSelect));

            u32CR |= pstcSogiPllInit->stcClarkInit.u32VoltageSelect;
        }

        WRITE_REG32(DSOGI_PLLx->CR, u32CR);
        FLOAT_WRITE_REG32(DSOGI_PLLx->TS, pstcSogiPllInit->stcBaseInit.f32Ts);
        FLOAT_WRITE_REG32(DSOGI_PLLx->FREBASE, pstcSogiPllInit->stcBaseInit.f32BaseFreq);
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_sogi_pll_init_t to default values.
 * @param [out] pstcSogiPllInit            Pointer to a @ref stc_sogi_pll_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcSogiPllInit is NULL
 */
int32_t DSOGI_PLL_StructInit(stc_sogi_pll_init_t *pstcSogiPllInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSogiPllInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcSogiPllInit->u32Func                       = DSOGI_PLL_COMB_THREE_PHASE_DSOGI;
        pstcSogiPllInit->stcClarkInit.u32SrcSelect     = DSOGI_PLL_CLARK_ABC;
        pstcSogiPllInit->stcClarkInit.u32AdcGain       = DSOGI_PLL_ADC_DIV1;
        pstcSogiPllInit->stcClarkInit.u32VoltageSelect = DSOGI_PLL_CLARK_PHASE_VOLT_ABC;
        pstcSogiPllInit->stcSogiInit.u32SogiSCSelect   = DSOGI_PLL_SOGI_SIN_COS_ENABLE;
        pstcSogiPllInit->stcSogiInit.u32FLLState       = DSOGI_PLL_FLL_ENABLE;
        pstcSogiPllInit->stcParkInit.u32ThetaSelect    = DSOGI_PLL_PARK_THETA_D;
        pstcSogiPllInit->stcPllInit.u32PIState         = DSOGI_PLL_PI_ENABLE;
        pstcSogiPllInit->stcPllInit.u32PLLState        = DSOGI_PLL_PLL_ENABLE;
        pstcSogiPllInit->stcPllInit.u32JudgeState      = DSOGI_PLL_JUDGE_DISABLE;
        pstcSogiPllInit->stcPllInit.u32DelayTime       = 1UL;
        pstcSogiPllInit->stcBaseInit.f32Ts             = DSOGI_PLL_SAMPLE_TIME_DEFAULT;
        pstcSogiPllInit->stcBaseInit.f32BaseFreq       = DSOGI_PLL_BASE_FREQUENCY_DEFAULT;
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_clark_init_t to default values.
 * @param [out] pstcClarkInit          Pointer to a @ref stc_clark_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcClarkInit is NULL
 */
int32_t DSOGI_PLL_Clark_StructInit(stc_clark_init_t *pstcClarkInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcClarkInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcClarkInit->u32SrcSelect     = DSOGI_PLL_CLARK_ABC;
        pstcClarkInit->u32VoltageSelect = DSOGI_PLL_CLARK_PHASE_VOLT_ABC;
        pstcClarkInit->u32AdcGain       = DSOGI_PLL_ADC_DIV1;
    }

    return i32Ret;
}

/**
 * @brief Initialize Clark base function.
 * @param [in] DSOGI_PLLx               Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcClarkInit       Pointer to a @ref stc_clark_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcClarkInit is NULL
 */
int32_t DSOGI_PLL_Clark_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_clark_init_t *pstcClarkInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcClarkInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        MODIFY_REG32(DSOGI_PLLx->CR,
                     (DSOGI_PLL_CR_DIN_SEL | DSOGI_PLL_CR_ADC_SEL | DSOGI_PLL_CR_LVOL_EN | DSOGI_PLL_CR_VOL_SEL
                      | DSOGI_PLL_CR_ADC_GN),
                     pstcClarkInit->u32SrcSelect | pstcClarkInit->u32VoltageSelect | pstcClarkInit->u32AdcGain);
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_clark_config_t to default values.
 * @param [out] pstcClarkConfig        Pointer to a @ref stc_clark_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcClarkConfig is NULL
 */
int32_t DSOGI_PLL_Clark_ConfigInit(stc_clark_config_t *pstcClarkConfig)
{
    int32_t i32Ret = LL_OK;

