MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
    if (NULL == pstcClarkConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcClarkConfig->clark_k = 1.0f;
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_sogi_init_t to default values.
 * @param [out] pstcSogiInit           Pointer to a @ref stc_sogi_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcSogiInit is NULL
 */
int32_t DSOGI_PLL_Sogi_StructInit(stc_sogi_init_t *pstcSogiInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSogiInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcSogiInit->u32SogiSCSelect = DSOGI_PLL_SOGI_CAUL_1;
        pstcSogiInit->u32FLLState     = DSOGI_PLL_FLL_ENABLE;
    }

    return i32Ret;
}

/**
 * @brief Initialize SOGI base function.
 * @param [in] DSOGI_PLLx               Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcSogiInit        Pointer to a @ref stc_sogi_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcSogiInit is NULL
 */
int32_t DSOGI_PLL_Sogi_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_sogi_init_t *pstcSogiInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSogiInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
        DDL_ASSERT(IS_DSOGI_PLL_SOGI_CALC(pstcSogiInit->u32SogiSCSelect));
        DDL_ASSERT(IS_DSOGI_PLL_FLL_STATE(pstcSogiInit->u32FLLState));

        MODIFY_REG32(DSOGI_PLLx->CR,
                     DSOGI_PLL_CR_FLL_EN | DSOGI_PLL_CR_SOGI_SC,
                     pstcSogiInit->u32SogiSCSelect | pstcSogiInit->u32FLLState);
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_sogi_config_t to default values.
 * @param [out] pstcSogiConfig         Pointer to a @ref stc_sogi_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcSogiConfig is NULL
 */
int32_t DSOGI_PLL_Sogi_ConfigInit(stc_sogi_config_t *pstcSogiConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSogiConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcSogiConfig->sogi_k     = 1.0f;
        pstcSogiConfig->sogi_d_k   = 1.0f;
        pstcSogiConfig->sogi_q_k   = 1.0f;
        pstcSogiConfig->sogi_fll_k = -0.001274f;
        pstcSogiConfig->sogi_max   = 15.0f;
        pstcSogiConfig->sogi_min   = -15.0f;
        pstcSogiConfig->sogi_w     = DSOGI_PLL_CENTER_ANGLE_FREQ;
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_park_init_t to default values.
 * @param [out] pstcParkInit           Pointer to a @ref stc_park_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcParkInit is NULL
 * @note The function is invalid when the Park independently work.
 */
int32_t DSOGI_PLL_Park_StructInit(stc_park_init_t *pstcParkInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcParkInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcParkInit->u32ThetaSelect = DSOGI_PLL_PARK_THETA_Q;
    }

    return i32Ret;
}

/**
 * @brief Initialize Park base function.
 * @param [in] DSOGI_PLLx               Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcParkInit        Pointer to a @ref stc_park_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcParkInit is NULL
 * @note The function is invalid when the Park independently work.
 */
int32_t DSOGI_PLL_Park_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_park_init_t *pstcParkInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcParkInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
        DDL_ASSERT(IS_DSOGI_PLL_PARK_THETA(pstcParkInit->u32ThetaSelect));

        MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_CR_THETA_SEL, pstcParkInit->u32ThetaSelect);
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_park_config_t to default values.
 * @param [out] pstcParkConfig         Pointer to a @ref stc_park_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcParkConfig is NULL
 */
int32_t DSOGI_PLL_Park_ConfigInit(stc_park_config_t *pstcParkConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcParkConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcParkConfig->park_theta = 0.0f;
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_pll_init_t to default values.
 * @param [out] pstcPllInit            Pointer to a @ref stc_pll_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcPllInit is NULL
 * @note The parameters u32PLLState and u32JudgeState are invalid when the PLL independently work.
 */
int32_t DSOGI_PLL_Pll_StructInit(stc_pll_init_t *pstcPllInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcPllInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcPllInit->u32PIState    = DSOGI_PLL_PI_ENABLE;
        pstcPllInit->u32PLLState   = DSOGI_PLL_PLL_DISABLE;
        pstcPllInit->u32DelayTime  = 1UL;
        pstcPllInit->u32JudgeState = DSOGI_PLL_JUDGE_DISABLE;
    }

    return i32Ret;
}

/**
 * @brief Initialize PLL base function.
 * @param [in] DSOGI_PLLx               Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcPllInit         Pointer to a @ref stc_pll_init_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcPllInit is NULL
 * @note The parameters u32PLLState and u32JudgeState are invalid when the PLL independently work.
 */
int32_t DSOGI_PLL_Pll_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_pll_init_t *pstcPllInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcPllInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
        DDL_ASSERT(IS_DSOGI_PLL_PLL_PI_STATE(pstcPllInit->u32PIState));
        DDL_ASSERT(IS_DSOGI_PLL_PLL_STATE(pstcPllInit->u32PLLState));
        DDL_ASSERT(IS_DSOGI_PLL_VOLT_JUDGE_STATE(pstcPllInit->u32JudgeState));
        DDL_ASSERT(IS_DSOGI_PLL_DELAYTIME(pstcPllInit->u32DelayTime));

        MODIFY_REG32(DSOGI_PLLx->CR,
                     (DSOGI_PLL_CR_PI_EN | DSOGI_PLL_CR_PLL_EN | DSOGI_PLL_CR_JUDGE_EN | DSOGI_PLL_CR_DELAY_TIME),
                     pstcPllInit->u32PIState | pstcPllInit->u32PLLState | pstcPllInit->u32JudgeState
                         | pstcPllInit->u32DelayTime << DSOGI_PLL_CR_DELAY_TIME_POS);
    }

    return i32Ret;
}

/**
 * @brief Set the fields of structure stc_pll_config_t to default values.
 * @param [out] pstcPllConfig          Pointer to a @ref stc_pll_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: pstcPllConfig is NULL
 */
int32_t DSOGI_PLL_Pll_ConfigInit(stc_pll_config_t *pstcPllConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcPllConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcPllConfig->pll_k  = 1.0f;
        pstcPllConfig->pll_kp = 0.033f;
        pstcPllConfig->pll_ki_ts = 0.00000152f * 5.0f * 5.0f;
        pstcPllConfig->pll_max        = 15.0f;
        pstcPllConfig->pll_min        = -15.f;
        pstcPllConfig->pll_err        = 1.0f;
        pstcPllConfig->pll_theta_cmp1 = 0.0314159265f;
        pstcPllConfig->pll_theta_cmp2 = 3.110176727f;
        pstcPllConfig->pll_theta_cmp3 = 3.17300858f;
        pstcPllConfig->pll_theta_cmp4 = 6.251769380f;
        pstcPllConfig->pll_v_cmp      = 10.0f;
        pstcPllConfig->pll_theta_step = DSOGI_PLL_PI / 10.0f;
        pstcPllConfig->pll_w          = DSOGI_PLL_CENTER_ANGLE_FREQ;
    }

    return i32Ret;
}

/**
 * @brief Configure clark parameters.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcClarkConfig         Pointer to a @ref stc_clark_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Configure success
 *         - LL_ERR_INVD_PARAM: pstcClarkConfig is NULL
 */
int32_t DSOGI_PLL_Clark_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_clark_config_t *pstcClarkConfig)
{
    int32_t i32Ret = LL_OK;

