MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
    if (NULL == pstcClarkConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->CLARKK, pstcClarkConfig->clark_k);
    }

    return i32Ret;
}

/**
 * @brief Configure sogi parameters.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcSogiConfig          Pointer to a @ref stc_sogi_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Configure success
 *         - LL_ERR_INVD_PARAM: pstcSogiConfig is NULL
 */
int32_t DSOGI_PLL_Sogi_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_sogi_config_t *pstcSogiConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSogiConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->K, pstcSogiConfig->sogi_k);
        FLOAT_WRITE_REG32(DSOGI_PLLx->DK, pstcSogiConfig->sogi_d_k);
        FLOAT_WRITE_REG32(DSOGI_PLLx->QK, pstcSogiConfig->sogi_q_k);
        FLOAT_WRITE_REG32(DSOGI_PLLx->FLLK, pstcSogiConfig->sogi_fll_k);
        FLOAT_WRITE_REG32(DSOGI_PLLx->MAX, pstcSogiConfig->sogi_max);
        FLOAT_WRITE_REG32(DSOGI_PLLx->MIN, pstcSogiConfig->sogi_min);
        FLOAT_WRITE_REG32(DSOGI_PLLx->W, pstcSogiConfig->sogi_w);
    }

    return i32Ret;
}

/**
 * @brief Configure park parameters.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcParkConfig          Pointer to a @ref stc_park_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Configure success
 *         - LL_ERR_INVD_PARAM: pstcParkConfig is NULL
 */
int32_t DSOGI_PLL_Park_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_park_config_t *pstcParkConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcParkConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->PARKTHETA, pstcParkConfig->park_theta);
    }

    return i32Ret;
}

/**
 * @brief Configure pll parameters.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] pstcPllConfig           Pointer to a @ref stc_pll_config_t structure.
 * @retval int32_t:
 *         - LL_OK: Configure success
 *         - LL_ERR_INVD_PARAM: pstcPllConfig is NULL
 */
int32_t DSOGI_PLL_Pll_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_pll_config_t *pstcPllConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcPllConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLK, pstcPllConfig->pll_k);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLKP, pstcPllConfig->pll_kp);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLKITS, pstcPllConfig->pll_ki_ts);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLMAX, pstcPllConfig->pll_max);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLMIN, pstcPllConfig->pll_min);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLFINISHERRTH, pstcPllConfig->pll_err);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLTHETACMP1, pstcPllConfig->pll_theta_cmp1);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLTHETACMP2, pstcPllConfig->pll_theta_cmp2);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLTHETACMP3, pstcPllConfig->pll_theta_cmp3);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLTHETACMP4, pstcPllConfig->pll_theta_cmp4);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLVGCMP, pstcPllConfig->pll_v_cmp);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLTHETASTEP, pstcPllConfig->pll_theta_step);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLW, pstcPllConfig->pll_w);
    }

    return i32Ret;
}

/**
 * @brief Set SOGI run function.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32Func                 Run mode @ref DSOGI_PLL_FUNC_SEL.
 * @retval None
 */
void DSOGI_PLL_Set_Func(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32Func)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_FUNC(u32Func));

    MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_FUN_MASK, u32Func);
}

/**
 * @brief Set PLL enable or disable.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note When function is Combination, if PLL is disabele the sogi's w be written through owner register.
 */
void DSOGI_PLL_PLL_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        if (DSOGI_PLL_CR_MODE == (DSOGI_PLLx->CR & DSOGI_PLL_CR_MODE))
        {
            SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_PLL_EN);
        }
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_PLL_EN);
    }
}

/**
 * @brief Set SOGI pi enable or disable.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note When PI is 0, the out freq of pll equal base-frequency.
 */
void DSOGI_PLL_PI_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_PI_EN);
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_PI_EN);
    }
}

/**
 * @brief Set SOGI fll enable or disable.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note When FLL_EN is 1, SOGI's w be updated with FLL's results.
 */
void DSOGI_PLL_FLL_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

