MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_FLL_EN);
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_FLL_EN);
    }
}

/**
 * @brief Set SOGI judge enable or disable.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note When the PLL operates independently, this signal is inactive.
 */
void DSOGI_PLL_Judge_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        if (DSOGI_PLL_CR_MODE == (DSOGI_PLLx->CR & DSOGI_PLL_CR_MODE))
        {
            SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_JUDGE_EN);
        }
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_JUDGE_EN);
    }
}

/**
 * @brief Set SOGI sogi calculation count.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32SogiSelect           Calculation count @ref DSOGI_PLL_SOGI_SC_SEL.
 * @retval None
 * @note The function is valid only when the SOGI is independently run.
 */
void DSOGI_PLL_Sogi_Calc_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32SogiSelect)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_SOGI_CALC(u32SogiSelect));

    MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_CR_SOGI_SC, u32SogiSelect);
}

/**
 * @brief Enable or disable PLL sin/cos calculation.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note The function is valid only when the Double-SOGI and Single-Phase mode.
 */
void DSOGI_PLL_PLL_SC_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_SOGI_SC);
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_SOGI_SC);
    }
}

/**
 * @brief Set SOGI park output select.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32ThetaSelect          Specifies the d/q signal of park output to pll @ref DSOGI_PLL_PARK_THETA_SEL.
 * @retval None
 * @note The function is inavalid when the park mode is independently.
 */
void DSOGI_PLL_Park_Theta_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32ThetaSelect)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_PARK_THETA(u32ThetaSelect));

    MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_CR_THETA_SEL, u32ThetaSelect);
}

/**
 * @brief Set SOGI clark input select.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32InputSelect          Specifies the input source of clark of SOGI @ref DSOGI_PLL_CLARK_INPUT_SEL.
 * @retval None
 * @note When the SOGI function is independently, can only be write via abc registers.
 */
void DSOGI_PLL_Clark_Input_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32InputSelect)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_CLARK_SRC(u32InputSelect));

    MODIFY_REG32(DSOGI_PLLx->CR, (DSOGI_PLL_CR_ADC_SEL | DSOGI_PLL_CR_DIN_SEL), u32InputSelect);
}

/**
 * @brief Set SOGI clark input voltage select.
 * @param [in] DSOGI_PLLx                   Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32VoltageSelect        Specifies the input voltage source of clark of SOGI @ref DSOGI_PLL_CLARK_VOLT_SEL.
 * @retval None
 */
void DSOGI_PLL_Clark_Voltage_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32VoltageSelect)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_CLARK_VOLT(u32VoltageSelect));

    MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_CLARK_VOLT_MASK, u32VoltageSelect);
}

/**
 * @brief Set SOGI clark adc gain select.
 * @param [in] DSOGI_PLLx                   Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32AdcGainSelect        Specifies the adc gain of clark of SOGI @ref DSOGI_PLL_ADC_GAIN_SEL.
 * @retval None
 * @note The function is valid only when the clark input source is ADC.
 */
void DSOGI_PLL_Clark_Adc_Gain_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32AdcGainSelect)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_CLARK_ADC_GAIN(u32AdcGainSelect));

    MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_CR_ADC_GN, u32AdcGainSelect);
}

/**
 * @brief Set SOGI locked phase delaytime.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32DelayTime            Less than SOGI_DELAYTIME_MAX. actual value equal u32DelayTime * 256.
 * @retval None
 */
void DSOGI_PLL_Set_Delaytime(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32DelayTime)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_DELAYTIME(u32DelayTime));

    MODIFY_REG32(DSOGI_PLLx->CR, DSOGI_PLL_CR_DELAY_TIME, u32DelayTime << DSOGI_PLL_CR_DELAY_TIME_POS);
}

/**
 * @brief Set SOGI interrupt enable or disable.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32IntType              Specifical interrupt @ref DSOGI_PLL_INT.
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void DSOGI_PLL_Int_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32IntType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

