MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(DSOGI_PLLx->CR, u32IntType);
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, u32IntType);
    }
}

/**
 * @brief Get SOGI State flags.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32Flag            SOGI state flag. Can be one or any
 *        combination of the parameter of @ref DSOGI_PLL_FLAG
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t DSOGI_PLL_GetStatus(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_FLAG(u32Flag));

    return (0UL == (DSOGI_PLLx->ST & u32Flag)) ? RESET : SET;
}

/**
 * @brief Clear SOGI state flags.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance
 * @param [in] u32Flag            SOGI state flag. Can be one or any
 *        combination of the parameter of @ref DSOGI_PLL_CLR_FLAG
 * @retval None.
 */
void DSOGI_PLL_ClearStatus(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_DSOGI_PLL_CLR_FLAG(u32Flag));

    WRITE_REG32(DSOGI_PLLx->ST, u32Flag);
}

/**
 * @brief Set SOGI start enable or disable.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void DSOGI_PLL_Start_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* When mode is 1, it functions as an enable bit (remains active after writing 1 and inactive after writing 0).
       When mode is 0, it functions as a trigger enable bit (activates operation after writing 1; writing 0 has no effect,
       and the bit automatically resets to zero after calculate completes). */

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_START);
    }
    else
    {
        CLR_REG32_BIT(DSOGI_PLLx->CR, DSOGI_PLL_CR_START);
    }
}

/**
 * @brief Write SOGI clark input value.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [in] pstcClarkInput          Pointer to a @ref stc_clark_input_t structure.
 * @retval int32_t:
 *         - LL_OK: Write success
 *         - LL_ERR_INVD_PARAM: pstcClarkInput is NULL
 * @note The function ia valid when clark input source is abc.
 */
int32_t DSOGI_PLL_Clark_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_clark_input_t *pstcClarkInput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));
    DDL_ASSERT(0UL == (DSOGI_PLLx->CR & DSOGI_PLL_CR_DIN_SEL));

    if (NULL == pstcClarkInput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->CLARKAS, pstcClarkInput->a);
        FLOAT_WRITE_REG32(DSOGI_PLLx->CLARKBS, pstcClarkInput->b);
        FLOAT_WRITE_REG32(DSOGI_PLLx->CLARKCS, pstcClarkInput->c);
    }

    return i32Ret;
}

/**
 * @brief Read SOGI clark output value.
 * @param [in] DSOGI_PLLx                   Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [in] pstcClarkOutput         Pointer to a @ref stc_clark_output_t structure.
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: pstcClarkOutput is NULL
 */
int32_t DSOGI_PLL_Clark_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_clark_output_t *pstcClarkOutput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcClarkOutput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcClarkOutput->alpha    = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->CLARKDS);
        pstcClarkOutput->beta     = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->CLARKQS);
        pstcClarkOutput->a_filter = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->CLARKFLTA);
        pstcClarkOutput->b_filter = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->CLARKFLTB);
        pstcClarkOutput->c_filter = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->CLARKFLTC);
    }

    return i32Ret;
}

/**
 * @brief Write SOGI sogi input signal.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [in] pstcSogiInput           Pointer to a @ref stc_sogi_input_t structure.
 * @retval int32_t:
 *         - LL_OK: Write success
 *         - LL_ERR_INVD_PARAM: pstcSogiInput is NULL
 * @note The function is valid only when SOGI work on independently mode.
 */
int32_t DSOGI_PLL_Sogi_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_sogi_input_t *pstcSogiInput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcSogiInput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->DS, pstcSogiInput->alpha);
        /* SOGI indenpedent run and selcect twice sogi calculatin */

        if (DSOGI_PLL_CR_SOGI_SC == (DSOGI_PLLx->CR & DSOGI_PLL_CR_SOGI_SC))
        {
            FLOAT_WRITE_REG32(DSOGI_PLLx->QS, pstcSogiInput->beta);
        }
    }

    return i32Ret;
}

/**
 * @brief Read SOGI sogi output signal.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [out] pstcSogiOutput         Pointer to a @ref stc_sogi_output_t structure.
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: pstcSogiOutput is NULL
 */
int32_t DSOGI_PLL_Sogi_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_sogi_output_t *pstcSogiOutput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcSogiOutput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcSogiOutput->alpha_dv = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->ALPHADV);
        pstcSogiOutput->alpha_qv = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->ALPHAQV);
        pstcSogiOutput->beta_dv  = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->BETADV);
        pstcSogiOutput->beta_qv  = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->BETAQV);
        pstcSogiOutput->alpha_p  = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->VGRIDPDS);
        pstcSogiOutput->beta_p   = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->VGRIDPQS);
        pstcSogiOutput->alpha_n  = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->VGRIDNDS);
        pstcSogiOutput->beta_n   = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->VGRIDNQS);
    }

    return i32Ret;
}

/**
 * @brief Write SOGI park input signal.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [in] pstcParkInput           Pointer to a @ref stc_park_input_t structure.
 * @retval int32_t:
 *         - LL_OK: Write success
 *         - LL_ERR_INVD_PARAM: pstcParkInput is NULL
 * @note The function is valid only when park work on independently mode.
 */
int32_t DSOGI_PLL_Park_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_park_input_t *pstcParkInput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcParkInput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->PARKDS, pstcParkInput->alpha);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PARKQS, pstcParkInput->beta);
        FLOAT_WRITE_REG32(DSOGI_PLLx->PARKTHETA, pstcParkInput->theta);
    }

    return i32Ret;
}

/**
 * @brief Read SOGI park output signal.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [out] pstcParkOutput         Pointer to a @ref stc_park_output_t structure.
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: pstcParkOutput is NULL
 */
int32_t DSOGI_PLL_Park_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_park_output_t *pstcParkOutput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

