MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_dsogi_pll.c
    if (NULL == pstcParkOutput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcParkOutput->d         = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PARKDE);
        pstcParkOutput->q         = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PARKQE);
        pstcParkOutput->sin_theta = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PARKSIN);
        pstcParkOutput->cos_theta = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PARKCOS);
    }

    return i32Ret;
}

/**
 * @brief Write SOGI input signal.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [in] pstcPllInput            Pointer to a @ref stc_pll_input_t structure.
 * @retval int32_t:
 *         - LL_OK: Write success
 *         - LL_ERR_INVD_PARAM: pstcPllInput is NULL
 * @note The function is valid only when PLL work on independently mode.
 */
int32_t DSOGI_PLL_Pll_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_pll_input_t *pstcPllInput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcPllInput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        FLOAT_WRITE_REG32(DSOGI_PLLx->PLLDIN, pstcPllInput->din);
    }

    return i32Ret;
}

/**
 * @brief Read SOGI park output signal.
 * @param [in] DSOGI_PLLx                Pointer to SOGI unit instance
 *        This parameter can be one of the following values:
 * @arg CM_DSOGI_PLL or CM_DSOGI_PLL_x: SOGI unit instance.
 * @param [out] pstcPllOutput          Pointer to a @ref stc_pll_output_t structure.
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: pstcPllOutput is NULL
 */
int32_t DSOGI_PLL_Pll_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_pll_output_t *pstcPllOutput)
{
    int32_t i32Ret = LL_OK;

    DDL_ASSERT(IS_DSOGI_PLL_PERIPH(DSOGI_PLLx));

    if (NULL == pstcPllOutput)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcPllOutput->w          = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLW);
        pstcPllOutput->theta      = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLTHETA);
        pstcPllOutput->theta_pi   = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLTHETA_PI);
        pstcPllOutput->freq       = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLFREQ);
        pstcPllOutput->p          = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLUP);
        pstcPllOutput->i          = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLUI);
        pstcPllOutput->pi         = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLPI);
        pstcPllOutput->din_filter = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLDINFLT);
        pstcPllOutput->sin_theta  = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLSIN);
        pstcPllOutput->cos_theta  = DSOGI_PLL_FLOAT_CONV(DSOGI_PLLx->PLLCOS);
    }

    return i32Ret;
}

/**
 * @}
 */

#endif /* LL_DSOGI_PLL_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
